{"full_text": "b'Panjab Floods: Womens Hygiene and Sanitary Items: \\n\\nOur @khalsaaid_india team is providing support for the women in the flooded areas of Panjab. \\n\\nFloods Donation Link: https://t.co/KJZV10XT4v https://t.co/gem4FJCW3F'", "date": "2019-08-30 13:44:05", "id": "17704559"}
{"full_text": "b'@FYF_Charity @HopeGordon_ Superstar athlete Hope \\xf0\\x9f\\x91\\x8f\\xf0\\x9f\\x91\\x8f'", "date": "2019-08-30 13:44:03", "id": "783064063"}
{"full_text": "b'@DeannaKobet They also auto-convert any hyperlink to a charity into a \\xe2\\x80\\x9cFacebook fundraiser\\xe2\\x80\\x9d format. When we asked for donations instead of flowers for dad it popped up.\\n\\nI think a lot of it has to do with keeping people ON Facebook as opposed to hopping across the web and losing ad revenue.'", "date": "2019-08-30 13:44:02", "id": "2996869166"}
{"full_text": "b'If you haven\\xe2\\x80\\x99t heard already, there\\xe2\\x80\\x99s an amazing charity D&amp;D event happening in November to benefit Alzheimer\\xe2\\x80\\x99s research, with proceeds going to @alzassociation \\nThere is an AMAZING lineup of sponsors too, so the prizes available are going to be incredible. Check it out! https://t.co/Yl0eHROXFM'", "date": "2019-08-30 13:44:01", "id": "164733145"}
{"full_text": "b'Great coverage of Helping Hands summer programme in today\\xe2\\x80\\x99s #Edinburgh Evening News.\\nSolidarity Not Charity \\xe2\\x9c\\x8a\\xef\\xb8\\x8f\\n\\nThanks to @edinspotlight for the screenshots \\xf0\\x9f\\x91\\x8f https://t.co/TWeQZZwda3'", "date": "2019-08-30 13:43:59", "id": "726663090"}
{"full_text": "b\"This is good, though I would add conservatism is not just free markets and voluntary charity, and it's a mistake to argue that's all it is. https://t.co/7w7dV0kTA8\"", "date": "2019-08-30 13:43:55", "id": "1084264573"}
{"full_text": "b'ANNOUNCEMENT: Pleased to announce that US Congressman @timburchett will give opening remarks at our 5th Annual Knoxville Fitness Challenge Healthy Living Charity Event!\\n\\nRegister: https://t.co/vWdhB4NVMN\\n\\n#knoxvillefitnesschallenge #knoxnews #wbir #wvlt #geoffhampton #knoxrocks https://t.co/QfthjAgRHr'", "date": "2019-08-30 13:43:53", "id": "259365796"}
{"full_text": "b'@TheChocoHunk Donate my dub to any charity that helps kids'", "date": "2019-08-30 13:43:53", "id": "183502756"}
{"full_text": "b'@pulte Charity see the need not the cause'", "date": "2019-08-30 13:43:51", "id": "1154069391077781504"}
{"full_text": "b'#2DaysToMahaParopkarMonth\\n@derasachasauda \\nSaintDr. @Gurmeetramrahim Singh ji insan Come between us in september\\nWas conferred with Gurugaddi on 23 September, since then this month is celebrated as General charity day. https://t.co/uz3qj6m2Sb'", "date": "2019-08-30 13:43:50", "id": "4266831333"}
{"full_text": "b'Last night at the #Oxfordshire Local Business #charity \\nAwards, we asked the nominating charities to describe their nominees in ONE WORD - these are the words they chose..\\nThanks @brennannicholls for your help with this! #LBCAOxon https://t.co/3bPoBUPPiJ'", "date": "2019-08-30 13:43:50", "id": "2394666206"}
{"full_text": "b\"Don't forget to come and visit us at the @prospecthospice garden fete in Wroughton from 12pm tomorrow! We've got an hourly raffle with lots of great prizes to be won! #charity #Prospecthospice #summerfete #wroughton #swindon\"", "date": "2019-08-30 13:43:50", "id": "626575112"}
{"full_text": "b'Thank you for naming our Celebrating Life Luncheon featuring @nicoleCmullen as one the most highly anticipated fall luncheons, CultureMap Dallas!\\n6 Dallas luncheons rolling out the red carpet for hot Hollywood headliners this fall https://t.co/bku7KN4M9b via @CultureMapDal'", "date": "2019-08-30 13:43:49", "id": "216235820"}
{"full_text": "b'#\\xe0\\xa4\\xaa\\xe0\\xa5\\x82\\xe0\\xa4\\xb0\\xe0\\xa5\\x8d\\xe0\\xa4\\xa3\\xe0\\xa4\\x97\\xe0\\xa5\\x81\\xe0\\xa4\\xb0\\xe0\\xa5\\x81_\\xe0\\xa4\\xb8\\xe0\\xa4\\x82\\xe0\\xa4\\xa4\\xe0\\xa4\\xb0\\xe0\\xa4\\xbe\\xe0\\xa4\\xae\\xe0\\xa4\\xaa\\xe0\\xa4\\xbe\\xe0\\xa4\\xb2\\xe0\\xa4\\x9c\\xe0\\xa5\\x80\\nKabir, Guru without turning garland, Guru without giving charity.\\n Guru bin is both fruitless, ask whether the Beda Purana.\\n Guru bin Naam revokes or donates a garland of chanting, that is in vain.  This is also evident in the Vedas and Puranas. https://t.co/SACS9EGRGU'", "date": "2019-08-30 13:43:47", "id": "881089554173894656"}
{"full_text": "b'Summer Sweep Sale! 20% Off Store Wide!!\\nTammysTreasures554 -Ebay - 10% Of All Sales Go To Charity \\nhttps://t.co/x5zLCBtjxC https://t.co/j2kzcgNDrU'", "date": "2019-08-30 13:43:46", "id": "762120547958259712"}
{"full_text": "b'May God bless them kids that these niggas be lien on cus they don\\xe2\\x80\\x99t deserve all that \\xf0\\x9f\\xa5\\xba'", "date": "2019-08-30 13:43:45", "id": "1327245199"}
{"full_text": "b'Audrey Hepburn at the charity ball Les Petits Lits Blancs aboard the liner France in Le Havre, France, January 14, 1962. #audreyhepburn https://t.co/njgOruCOSd'", "date": "2019-08-30 14:46:18", "id": "475290457"}
{"full_text": "b\"Through their 'Integrity Initiative' project, the Institute for Statecraft \\xe2\\x88\\x92 a state-funded charity \\xe2\\x88\\x92 conducted a number of shady activities, like smearing Jeremy Corbyn.\\n\\nThis requires a public inquiry. Watch what happened when I visited their London office earlier this year. https://t.co/42LOIhFcDO\"", "date": "2019-08-30 14:46:18", "id": "4490483835"}
{"full_text": "b'Sunday morning looks sunny - so why not join this fundraising family walk? It is a way to help raise funds for the Park along with a second charity chosen by the organisers. You will find all details online https://t.co/9fAo10AEpg'", "date": "2019-08-30 14:46:17", "id": "2243735090"}
{"full_text": "b'Cheating at a charity golf day. Yay or nay? \\n@mattricho0\\n@NathanBrown_07\\n\\nListen to Richo, Browny &amp; Hummer here  -  https://t.co/yI4xyEKPYC https://t.co/Oo9zflwHId'", "date": "2019-08-30 14:46:15", "id": "355525834"}